onec/extension/xml/Catalogs/PlatformLog.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>PlatformLog</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Operation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreatedAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/extension/xml/CommonModules/PlatformAPI_Log/Ext/Module.bsl
// Общий модуль PlatformAPI_Log (Сервер ✔, Внешнее соединение ✔, Привилегированный ✔).
// Журнал записей приложения: один элемент справочника PlatformLog на каждую запись в базу.
// Он же — индекс ExternalID: по нему повторный импорт находит уже созданный документ.
// Привилегированный, чтобы журнал вёлся и читался при любых правах пользователя (отдельная роль
// не нужна); вызывается только из PlatformAPI внутри той же транзакции, что и сама запись.

#Область ПрограммныйИнтерфейс

// Исключительная управляемая блокировка всего журнала до конца транзакции. Журнал пишет только
// PlatformAPI, поэтому записи приложения идут по очереди, а работа бухгалтеров не блокируется.
Процедура Заблокировать() Экспорт
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("Справочник.PlatformLog");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
КонецПроцедуры

// Документ, уже созданный из этого источника с этим ExternalID, или Неопределено.
// Удалённый или помеченный на удаление документ не считается: такой импорт создаст документ заново.
Функция НайтиДокумент(Источник, ВнешнийИД, ИмяДокумента) Экспорт
	Запрос = Новый Запрос(СтрШаблон(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Д.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.PlatformLog КАК Л
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.%1 КАК Д
	|		ПО Л.Document = Д.Ссылка
	|ГДЕ
	|	Л.Source = &Источник
	|	И Л.ExternalID = &ВнешнийИД
	|	И НЕ Д.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	Л.CreatedAt УБЫВ", ИмяДокумента));
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ВнешнийИД", ВнешнийИД);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
КонецФункции

Процедура Записать(Источник, ВнешнийИД, Документ, Операция) Экспорт
	Запись = Справочники["PlatformLog"].СоздатьЭлемент(); // по имени: модуль компилируется и до создания справочника
	Запись.Наименование = Лев(Операция + " " + ВнешнийИД, 150);
	Запись.Source = Источник;
	Запись.ExternalID = ВнешнийИД;
	Запись.Document = Документ;
	Запись.Operation = Операция;
	Запись.UserName = ИмяПользователя();
	Запись.CreatedAt = ТекущаяДатаСеанса();
	Запись.Записать();
КонецПроцедуры

#КонецОбласти
